Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/atdf/PIC32MZ1025DAB169.atdf
         <register caption="DMA Channel x Event Control Register" name="DCH7ECON" offset="0x5b0" rw="RW" size="4">
            <bitfield caption="Channel Abort IRQ Enable bit" mask="0x00000008" name="AIRQEN" values="DCH7ECON__AIRQEN" />
            <bitfield caption="Channel Start IRQ Enable bit" mask="0x00000010" name="SIRQEN" values="DCH7ECON__SIRQEN" />
            <bitfield caption="Channel Pattern Match Abort Enable bit" mask="0x00000020" name="PATEN" values="DCH7ECON__PATEN" />
            <bitfield caption="DMA Abort Transfer bit" mask="0x00000040" name="CABORT" values="DCH7ECON__CABORT" />
            <bitfield caption="DMA Forced Transfer bit" mask="0x00000080" name="CFORCE" values="DCH7ECON__CFORCE" />
            <bitfield caption="Channel Transfer Start IRQ bits" mask="0x0000FF00" name="CHSIRQ" values="DCH7ECON__CHSIRQ" />
            <bitfield caption="Channel Transfer Abort IRQ bits" mask="0x00FF0000" name="CHAIRQ" values="DCH7ECON__CHAIRQ" />
         </register>
         <register caption="DMA Channel x Interrupt Control Register" name="DCH0INT" offset="0x80" rw="RW" size="4">
            <bitfield caption="Channel Address Error Interrupt Flag bit" mask="0x00000001" name="CHERIF" values="DCH0INT__CHERIF" />
            <bitfield caption="Channel Transfer Abort Interrupt Flag bit" mask="0x00000002" name="CHTAIF" values="DCH0INT__CHTAIF" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Flag bit" mask="0x00000004" name="CHCCIF" values="DCH0INT__CHCCIF" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Flag bit" mask="0x00000008" name="CHBCIF" values="DCH0INT__CHBCIF" />
            <bitfield caption="Channel Destination Half Full Interrupt Flag bit" mask="0x00000010" name="CHDHIF" values="DCH0INT__CHDHIF" />
            <bitfield caption="Channel Destination Done Interrupt Flag bit" mask="0x00000020" name="CHDDIF" values="DCH0INT__CHDDIF" />
            <bitfield caption="Channel Source Half Empty Interrupt Flag bit" mask="0x00000040" name="CHSHIF" values="DCH0INT__CHSHIF" />
            <bitfield caption="Channel Source Done Interrupt Flag bit" mask="0x00000080" name="CHSDIF" values="DCH0INT__CHSDIF" />
            <bitfield caption="Channel Address Error Interrupt Enable bit" mask="0x00010000" name="CHERIE" values="DCH0INT__CHERIE" />
            <bitfield caption="Channel Transfer Abort Interrupt Enable bit" mask="0x00020000" name="CHTAIE" values="DCH0INT__CHTAIE" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Enable bit" mask="0x00040000" name="CHCCIE" values="DCH0INT__CHCCIE" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Enable bit" mask="0x00080000" name="CHBCIE" values="DCH0INT__CHBCIE" />
            <bitfield caption="Channel Destination Half Full Interrupt Enable bit" mask="0x00100000" name="CHDHIE" values="DCH0INT__CHDHIE" />
            <bitfield caption="Channel Destination Done Interrupt Enable bit" mask="0x00200000" name="CHDDIE" values="DCH0INT__CHDDIE" />
            <bitfield caption="Channel Source Half Empty Interrupt Enable bit" mask="0x00400000" name="CHSHIE" values="DCH0INT__CHSHIE" />
            <bitfield caption="Channel Source Done Interrupt Enable bit" mask="0x00800000" name="CHSDIE" values="DCH0INT__CHSDIE" />
         </register>
         <register caption="DMA Channel x Interrupt Control Register" name="DCH1INT" offset="0x140" rw="RW" size="4">
            <bitfield caption="Channel Address Error Interrupt Flag bit" mask="0x00000001" name="CHERIF" values="DCH1INT__CHERIF" />
            <bitfield caption="Channel Transfer Abort Interrupt Flag bit" mask="0x00000002" name="CHTAIF" values="DCH1INT__CHTAIF" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Flag bit" mask="0x00000004" name="CHCCIF" values="DCH1INT__CHCCIF" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Flag bit" mask="0x00000008" name="CHBCIF" values="DCH1INT__CHBCIF" />
            <bitfield caption="Channel Destination Half Full Interrupt Flag bit" mask="0x00000010" name="CHDHIF" values="DCH1INT__CHDHIF" />
            <bitfield caption="Channel Destination Done Interrupt Flag bit" mask="0x00000020" name="CHDDIF" values="DCH1INT__CHDDIF" />
            <bitfield caption="Channel Source Half Empty Interrupt Flag bit" mask="0x00000040" name="CHSHIF" values="DCH1INT__CHSHIF" />
            <bitfield caption="Channel Source Done Interrupt Flag bit" mask="0x00000080" name="CHSDIF" values="DCH1INT__CHSDIF" />
            <bitfield caption="Channel Address Error Interrupt Enable bit" mask="0x00010000" name="CHERIE" values="DCH1INT__CHERIE" />
            <bitfield caption="Channel Transfer Abort Interrupt Enable bit" mask="0x00020000" name="CHTAIE" values="DCH1INT__CHTAIE" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Enable bit" mask="0x00040000" name="CHCCIE" values="DCH1INT__CHCCIE" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Enable bit" mask="0x00080000" name="CHBCIE" values="DCH1INT__CHBCIE" />
            <bitfield caption="Channel Destination Half Full Interrupt Enable bit" mask="0x00100000" name="CHDHIE" values="DCH1INT__CHDHIE" />
            <bitfield caption="Channel Destination Done Interrupt Enable bit" mask="0x00200000" name="CHDDIE" values="DCH1INT__CHDDIE" />
            <bitfield caption="Channel Source Half Empty Interrupt Enable bit" mask="0x00400000" name="CHSHIE" values="DCH1INT__CHSHIE" />
            <bitfield caption="Channel Source Done Interrupt Enable bit" mask="0x00800000" name="CHSDIE" values="DCH1INT__CHSDIE" />
         </register>
         <register caption="DMA Channel x Interrupt Control Register" name="DCH2INT" offset="0x200" rw="RW" size="4">
            <bitfield caption="Channel Address Error Interrupt Flag bit" mask="0x00000001" name="CHERIF" values="DCH2INT__CHERIF" />
            <bitfield caption="Channel Transfer Abort Interrupt Flag bit" mask="0x00000002" name="CHTAIF" values="DCH2INT__CHTAIF" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Flag bit" mask="0x00000004" name="CHCCIF" values="DCH2INT__CHCCIF" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Flag bit" mask="0x00000008" name="CHBCIF" values="DCH2INT__CHBCIF" />
            <bitfield caption="Channel Destination Half Full Interrupt Flag bit" mask="0x00000010" name="CHDHIF" values="DCH2INT__CHDHIF" />
            <bitfield caption="Channel Destination Done Interrupt Flag bit" mask="0x00000020" name="CHDDIF" values="DCH2INT__CHDDIF" />
            <bitfield caption="Channel Source Half Empty Interrupt Flag bit" mask="0x00000040" name="CHSHIF" values="DCH2INT__CHSHIF" />
            <bitfield caption="Channel Source Done Interrupt Flag bit" mask="0x00000080" name="CHSDIF" values="DCH2INT__CHSDIF" />
            <bitfield caption="Channel Address Error Interrupt Enable bit" mask="0x00010000" name="CHERIE" values="DCH2INT__CHERIE" />
            <bitfield caption="Channel Transfer Abort Interrupt Enable bit" mask="0x00020000" name="CHTAIE" values="DCH2INT__CHTAIE" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Enable bit" mask="0x00040000" name="CHCCIE" values="DCH2INT__CHCCIE" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Enable bit" mask="0x00080000" name="CHBCIE" values="DCH2INT__CHBCIE" />
            <bitfield caption="Channel Destination Half Full Interrupt Enable bit" mask="0x00100000" name="CHDHIE" values="DCH2INT__CHDHIE" />
            <bitfield caption="Channel Destination Done Interrupt Enable bit" mask="0x00200000" name="CHDDIE" values="DCH2INT__CHDDIE" />
            <bitfield caption="Channel Source Half Empty Interrupt Enable bit" mask="0x00400000" name="CHSHIE" values="DCH2INT__CHSHIE" />
            <bitfield caption="Channel Source Done Interrupt Enable bit" mask="0x00800000" name="CHSDIE" values="DCH2INT__CHSDIE" />
         </register>
         <register caption="DMA Channel x Interrupt Control Register" name="DCH3INT" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="Channel Address Error Interrupt Flag bit" mask="0x00000001" name="CHERIF" values="DCH3INT__CHERIF" />
            <bitfield caption="Channel Transfer Abort Interrupt Flag bit" mask="0x00000002" name="CHTAIF" values="DCH3INT__CHTAIF" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Flag bit" mask="0x00000004" name="CHCCIF" values="DCH3INT__CHCCIF" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Flag bit" mask="0x00000008" name="CHBCIF" values="DCH3INT__CHBCIF" />
            <bitfield caption="Channel Destination Half Full Interrupt Flag bit" mask="0x00000010" name="CHDHIF" values="DCH3INT__CHDHIF" />
            <bitfield caption="Channel Destination Done Interrupt Flag bit" mask="0x00000020" name="CHDDIF" values="DCH3INT__CHDDIF" />
            <bitfield caption="Channel Source Half Empty Interrupt Flag bit" mask="0x00000040" name="CHSHIF" values="DCH3INT__CHSHIF" />
            <bitfield caption="Channel Source Done Interrupt Flag bit" mask="0x00000080" name="CHSDIF" values="DCH3INT__CHSDIF" />
            <bitfield caption="Channel Address Error Interrupt Enable bit" mask="0x00010000" name="CHERIE" values="DCH3INT__CHERIE" />
            <bitfield caption="Channel Transfer Abort Interrupt Enable bit" mask="0x00020000" name="CHTAIE" values="DCH3INT__CHTAIE" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Enable bit" mask="0x00040000" name="CHCCIE" values="DCH3INT__CHCCIE" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Enable bit" mask="0x00080000" name="CHBCIE" values="DCH3INT__CHBCIE" />
            <bitfield caption="Channel Destination Half Full Interrupt Enable bit" mask="0x00100000" name="CHDHIE" values="DCH3INT__CHDHIE" />
            <bitfield caption="Channel Destination Done Interrupt Enable bit" mask="0x00200000" name="CHDDIE" values="DCH3INT__CHDDIE" />
            <bitfield caption="Channel Source Half Empty Interrupt Enable bit" mask="0x00400000" name="CHSHIE" values="DCH3INT__CHSHIE" />
            <bitfield caption="Channel Source Done Interrupt Enable bit" mask="0x00800000" name="CHSDIE" values="DCH3INT__CHSDIE" />
         </register>
         <register caption="DMA Channel x Interrupt Control Register" name="DCH4INT" offset="0x380" rw="RW" size="4">
            <bitfield caption="Channel Address Error Interrupt Flag bit" mask="0x00000001" name="CHERIF" values="DCH4INT__CHERIF" />
            <bitfield caption="Channel Transfer Abort Interrupt Flag bit" mask="0x00000002" name="CHTAIF" values="DCH4INT__CHTAIF" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Flag bit" mask="0x00000004" name="CHCCIF" values="DCH4INT__CHCCIF" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Flag bit" mask="0x00000008" name="CHBCIF" values="DCH4INT__CHBCIF" />
            <bitfield caption="Channel Destination Half Full Interrupt Flag bit" mask="0x00000010" name="CHDHIF" values="DCH4INT__CHDHIF" />
            <bitfield caption="Channel Destination Done Interrupt Flag bit" mask="0x00000020" name="CHDDIF" values="DCH4INT__CHDDIF" />
            <bitfield caption="Channel Source Half Empty Interrupt Flag bit" mask="0x00000040" name="CHSHIF" values="DCH4INT__CHSHIF" />
            <bitfield caption="Channel Source Done Interrupt Flag bit" mask="0x00000080" name="CHSDIF" values="DCH4INT__CHSDIF" />
            <bitfield caption="Channel Address Error Interrupt Enable bit" mask="0x00010000" name="CHERIE" values="DCH4INT__CHERIE" />
            <bitfield caption="Channel Transfer Abort Interrupt Enable bit" mask="0x00020000" name="CHTAIE" values="DCH4INT__CHTAIE" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Enable bit" mask="0x00040000" name="CHCCIE" values="DCH4INT__CHCCIE" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Enable bit" mask="0x00080000" name="CHBCIE" values="DCH4INT__CHBCIE" />
            <bitfield caption="Channel Destination Half Full Interrupt Enable bit" mask="0x00100000" name="CHDHIE" values="DCH4INT__CHDHIE" />
            <bitfield caption="Channel Destination Done Interrupt Enable bit" mask="0x00200000" name="CHDDIE" values="DCH4INT__CHDDIE" />
            <bitfield caption="Channel Source Half Empty Interrupt Enable bit" mask="0x00400000" name="CHSHIE" values="DCH4INT__CHSHIE" />
            <bitfield caption="Channel Source Done Interrupt Enable bit" mask="0x00800000" name="CHSDIE" values="DCH4INT__CHSDIE" />
         </register>
         <register caption="DMA Channel x Interrupt Control Register" name="DCH5INT" offset="0x440" rw="RW" size="4">
            <bitfield caption="Channel Address Error Interrupt Flag bit" mask="0x00000001" name="CHERIF" values="DCH5INT__CHERIF" />
            <bitfield caption="Channel Transfer Abort Interrupt Flag bit" mask="0x00000002" name="CHTAIF" values="DCH5INT__CHTAIF" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Flag bit" mask="0x00000004" name="CHCCIF" values="DCH5INT__CHCCIF" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Flag bit" mask="0x00000008" name="CHBCIF" values="DCH5INT__CHBCIF" />
            <bitfield caption="Channel Destination Half Full Interrupt Flag bit" mask="0x00000010" name="CHDHIF" values="DCH5INT__CHDHIF" />
            <bitfield caption="Channel Destination Done Interrupt Flag bit" mask="0x00000020" name="CHDDIF" values="DCH5INT__CHDDIF" />
            <bitfield caption="Channel Source Half Empty Interrupt Flag bit" mask="0x00000040" name="CHSHIF" values="DCH5INT__CHSHIF" />
            <bitfield caption="Channel Source Done Interrupt Flag bit" mask="0x00000080" name="CHSDIF" values="DCH5INT__CHSDIF" />
            <bitfield caption="Channel Address Error Interrupt Enable bit" mask="0x00010000" name="CHERIE" values="DCH5INT__CHERIE" />
            <bitfield caption="Channel Transfer Abort Interrupt Enable bit" mask="0x00020000" name="CHTAIE" values="DCH5INT__CHTAIE" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Enable bit" mask="0x00040000" name="CHCCIE" values="DCH5INT__CHCCIE" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Enable bit" mask="0x00080000" name="CHBCIE" values="DCH5INT__CHBCIE" />
            <bitfield caption="Channel Destination Half Full Interrupt Enable bit" mask="0x00100000" name="CHDHIE" values="DCH5INT__CHDHIE" />
            <bitfield caption="Channel Destination Done Interrupt Enable bit" mask="0x00200000" name="CHDDIE" values="DCH5INT__CHDDIE" />
            <bitfield caption="Channel Source Half Empty Interrupt Enable bit" mask="0x00400000" name="CHSHIE" values="DCH5INT__CHSHIE" />
            <bitfield caption="Channel Source Done Interrupt Enable bit" mask="0x00800000" name="CHSDIE" values="DCH5INT__CHSDIE" />
         </register>
         <register caption="DMA Channel x Interrupt Control Register" name="DCH6INT" offset="0x500" rw="RW" size="4">
            <bitfield caption="Channel Address Error Interrupt Flag bit" mask="0x00000001" name="CHERIF" values="DCH6INT__CHERIF" />
            <bitfield caption="Channel Transfer Abort Interrupt Flag bit" mask="0x00000002" name="CHTAIF" values="DCH6INT__CHTAIF" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Flag bit" mask="0x00000004" name="CHCCIF" values="DCH6INT__CHCCIF" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Flag bit" mask="0x00000008" name="CHBCIF" values="DCH6INT__CHBCIF" />
            <bitfield caption="Channel Destination Half Full Interrupt Flag bit" mask="0x00000010" name="CHDHIF" values="DCH6INT__CHDHIF" />
            <bitfield caption="Channel Destination Done Interrupt Flag bit" mask="0x00000020" name="CHDDIF" values="DCH6INT__CHDDIF" />
            <bitfield caption="Channel Source Half Empty Interrupt Flag bit" mask="0x00000040" name="CHSHIF" values="DCH6INT__CHSHIF" />
            <bitfield caption="Channel Source Done Interrupt Flag bit" mask="0x00000080" name="CHSDIF" values="DCH6INT__CHSDIF" />
            <bitfield caption="Channel Address Error Interrupt Enable bit" mask="0x00010000" name="CHERIE" values="DCH6INT__CHERIE" />
            <bitfield caption="Channel Transfer Abort Interrupt Enable bit" mask="0x00020000" name="CHTAIE" values="DCH6INT__CHTAIE" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Enable bit" mask="0x00040000" name="CHCCIE" values="DCH6INT__CHCCIE" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Enable bit" mask="0x00080000" name="CHBCIE" values="DCH6INT__CHBCIE" />
            <bitfield caption="Channel Destination Half Full Interrupt Enable bit" mask="0x00100000" name="CHDHIE" values="DCH6INT__CHDHIE" />
            <bitfield caption="Channel Destination Done Interrupt Enable bit" mask="0x00200000" name="CHDDIE" values="DCH6INT__CHDDIE" />
            <bitfield caption="Channel Source Half Empty Interrupt Enable bit" mask="0x00400000" name="CHSHIE" values="DCH6INT__CHSHIE" />
            <bitfield caption="Channel Source Done Interrupt Enable bit" mask="0x00800000" name="CHSDIE" values="DCH6INT__CHSDIE" />
         </register>
         <register caption="DMA Channel x Interrupt Control Register" name="DCH7INT" offset="0x5c0" rw="RW" size="4">
            <bitfield caption="Channel Address Error Interrupt Flag bit" mask="0x00000001" name="CHERIF" values="DCH7INT__CHERIF" />
            <bitfield caption="Channel Transfer Abort Interrupt Flag bit" mask="0x00000002" name="CHTAIF" values="DCH7INT__CHTAIF" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Flag bit" mask="0x00000004" name="CHCCIF" values="DCH7INT__CHCCIF" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Flag bit" mask="0x00000008" name="CHBCIF" values="DCH7INT__CHBCIF" />
            <bitfield caption="Channel Destination Half Full Interrupt Flag bit" mask="0x00000010" name="CHDHIF" values="DCH7INT__CHDHIF" />
            <bitfield caption="Channel Destination Done Interrupt Flag bit" mask="0x00000020" name="CHDDIF" values="DCH7INT__CHDDIF" />
            <bitfield caption="Channel Source Half Empty Interrupt Flag bit" mask="0x00000040" name="CHSHIF" values="DCH7INT__CHSHIF" />
            <bitfield caption="Channel Source Done Interrupt Flag bit" mask="0x00000080" name="CHSDIF" values="DCH7INT__CHSDIF" />
            <bitfield caption="Channel Address Error Interrupt Enable bit" mask="0x00010000" name="CHERIE" values="DCH7INT__CHERIE" />
            <bitfield caption="Channel Transfer Abort Interrupt Enable bit" mask="0x00020000" name="CHTAIE" values="DCH7INT__CHTAIE" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Enable bit" mask="0x00040000" name="CHCCIE" values="DCH7INT__CHCCIE" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Enable bit" mask="0x00080000" name="CHBCIE" values="DCH7INT__CHBCIE" />
            <bitfield caption="Channel Destination Half Full Interrupt Enable bit" mask="0x00100000" name="CHDHIE" values="DCH7INT__CHDHIE" />
            <bitfield caption="Channel Destination Done Interrupt Enable bit" mask="0x00200000" name="CHDDIE" values="DCH7INT__CHDDIE" />
            <bitfield caption="Channel Source Half Empty Interrupt Enable bit" mask="0x00400000" name="CHSHIE" values="DCH7INT__CHSHIE" />
            <bitfield caption="Channel Source Done Interrupt Enable bit" mask="0x00800000" name="CHSDIE" values="DCH7INT__CHSDIE" />
         </register>
         <register caption="DMA Channel x Source Start Address Register" name="DCH0SSA" offset="0x90" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHSSA" />
         </register>
         <register caption="DMA Channel x Source Start Address Register" name="DCH1SSA" offset="0x150" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHSSA" />
         </register>
         <register caption="DMA Channel x Source Start Address Register" name="DCH2SSA" offset="0x210" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHSSA" />
         </register>
         <register caption="DMA Channel x Source Start Address Register" name="DCH3SSA" offset="0x2d0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHSSA" />
         </register>
         <register caption="DMA Channel x Source Start Address Register" name="DCH4SSA" offset="0x390" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHSSA" />
         </register>
         <register caption="DMA Channel x Source Start Address Register" name="DCH5SSA" offset="0x450" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHSSA" />
         </register>
         <register caption="DMA Channel x Source Start Address Register" name="DCH6SSA" offset="0x510" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHSSA" />
         </register>
