Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/atdf/PIC32MZ1025DAB169.atdf
         <register caption="" name="GLCDCURDATA30" offset="0x878" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL723" />
            <bitfield mask="0x000000F0" name="PIXEL722" />
            <bitfield mask="0x00000F00" name="PIXEL721" />
            <bitfield mask="0x0000F000" name="PIXEL720" />
            <bitfield mask="0x000F0000" name="PIXEL719" />
            <bitfield mask="0x00F00000" name="PIXEL718" />
            <bitfield mask="0x0F000000" name="PIXEL717" />
            <bitfield mask="0xF0000000" name="PIXEL716" />
         </register>
         <register caption="" name="GLCDCURDATA31" offset="0x87C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL731" />
            <bitfield mask="0x000000F0" name="PIXEL730" />
            <bitfield mask="0x00000F00" name="PIXEL729" />
            <bitfield mask="0x0000F000" name="PIXEL728" />
            <bitfield mask="0x000F0000" name="PIXEL727" />
            <bitfield mask="0x00F00000" name="PIXEL726" />
            <bitfield mask="0x0F000000" name="PIXEL725" />
            <bitfield mask="0xF0000000" name="PIXEL724" />
         </register>
         <register caption="" name="GLCDCURDATA32" offset="0x880" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL87" />
            <bitfield mask="0x000000F0" name="PIXEL86" />
            <bitfield mask="0x00000F00" name="PIXEL85" />
            <bitfield mask="0x0000F000" name="PIXEL84" />
            <bitfield mask="0x000F0000" name="PIXEL83" />
            <bitfield mask="0x00F00000" name="PIXEL82" />
            <bitfield mask="0x0F000000" name="PIXEL81" />
            <bitfield mask="0xF0000000" name="PIXEL80" />
         </register>
         <register caption="" name="GLCDCURDATA33" offset="0x884" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL815" />
            <bitfield mask="0x000000F0" name="PIXEL814" />
            <bitfield mask="0x00000F00" name="PIXEL813" />
            <bitfield mask="0x0000F000" name="PIXEL812" />
            <bitfield mask="0x000F0000" name="PIXEL811" />
            <bitfield mask="0x00F00000" name="PIXEL810" />
            <bitfield mask="0x0F000000" name="PIXEL89" />
            <bitfield mask="0xF0000000" name="PIXEL88" />
         </register>
         <register caption="" name="GLCDCURDATA34" offset="0x888" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL823" />
            <bitfield mask="0x000000F0" name="PIXEL822" />
            <bitfield mask="0x00000F00" name="PIXEL821" />
            <bitfield mask="0x0000F000" name="PIXEL820" />
            <bitfield mask="0x000F0000" name="PIXEL819" />
            <bitfield mask="0x00F00000" name="PIXEL818" />
            <bitfield mask="0x0F000000" name="PIXEL817" />
            <bitfield mask="0xF0000000" name="PIXEL816" />
         </register>
         <register caption="" name="GLCDCURDATA35" offset="0x88C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL831" />
            <bitfield mask="0x000000F0" name="PIXEL830" />
            <bitfield mask="0x00000F00" name="PIXEL829" />
            <bitfield mask="0x0000F000" name="PIXEL828" />
            <bitfield mask="0x000F0000" name="PIXEL827" />
            <bitfield mask="0x00F00000" name="PIXEL826" />
            <bitfield mask="0x0F000000" name="PIXEL825" />
            <bitfield mask="0xF0000000" name="PIXEL824" />
         </register>
         <register caption="" name="GLCDCURDATA36" offset="0x890" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL97" />
            <bitfield mask="0x000000F0" name="PIXEL96" />
            <bitfield mask="0x00000F00" name="PIXEL95" />
            <bitfield mask="0x0000F000" name="PIXEL94" />
            <bitfield mask="0x000F0000" name="PIXEL93" />
            <bitfield mask="0x00F00000" name="PIXEL92" />
            <bitfield mask="0x0F000000" name="PIXEL91" />
            <bitfield mask="0xF0000000" name="PIXEL90" />
         </register>
         <register caption="" name="GLCDCURDATA37" offset="0x894" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL915" />
            <bitfield mask="0x000000F0" name="PIXEL914" />
            <bitfield mask="0x00000F00" name="PIXEL913" />
            <bitfield mask="0x0000F000" name="PIXEL912" />
            <bitfield mask="0x000F0000" name="PIXEL911" />
            <bitfield mask="0x00F00000" name="PIXEL910" />
            <bitfield mask="0x0F000000" name="PIXEL99" />
            <bitfield mask="0xF0000000" name="PIXEL98" />
         </register>
         <register caption="" name="GLCDCURDATA38" offset="0x898" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL923" />
            <bitfield mask="0x000000F0" name="PIXEL922" />
            <bitfield mask="0x00000F00" name="PIXEL921" />
            <bitfield mask="0x0000F000" name="PIXEL920" />
            <bitfield mask="0x000F0000" name="PIXEL919" />
            <bitfield mask="0x00F00000" name="PIXEL918" />
            <bitfield mask="0x0F000000" name="PIXEL917" />
            <bitfield mask="0xF0000000" name="PIXEL916" />
         </register>
         <register caption="" name="GLCDCURDATA39" offset="0x89C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL931" />
            <bitfield mask="0x000000F0" name="PIXEL930" />
            <bitfield mask="0x00000F00" name="PIXEL929" />
            <bitfield mask="0x0000F000" name="PIXEL928" />
            <bitfield mask="0x000F0000" name="PIXEL927" />
            <bitfield mask="0x00F00000" name="PIXEL926" />
            <bitfield mask="0x0F000000" name="PIXEL925" />
            <bitfield mask="0xF0000000" name="PIXEL924" />
         </register>
         <register caption="" name="GLCDCURDATA40" offset="0x8A0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL107" />
            <bitfield mask="0x000000F0" name="PIXEL106" />
            <bitfield mask="0x00000F00" name="PIXEL105" />
            <bitfield mask="0x0000F000" name="PIXEL104" />
            <bitfield mask="0x000F0000" name="PIXEL103" />
            <bitfield mask="0x00F00000" name="PIXEL102" />
            <bitfield mask="0x0F000000" name="PIXEL101" />
            <bitfield mask="0xF0000000" name="PIXEL100" />
         </register>
         <register caption="" name="GLCDCURDATA41" offset="0x8A4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1015" />
            <bitfield mask="0x000000F0" name="PIXEL1014" />
            <bitfield mask="0x00000F00" name="PIXEL1013" />
            <bitfield mask="0x0000F000" name="PIXEL1012" />
            <bitfield mask="0x000F0000" name="PIXEL1011" />
            <bitfield mask="0x00F00000" name="PIXEL1010" />
            <bitfield mask="0x0F000000" name="PIXEL109" />
            <bitfield mask="0xF0000000" name="PIXEL108" />
         </register>
         <register caption="" name="GLCDCURDATA42" offset="0x8A8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1023" />
            <bitfield mask="0x000000F0" name="PIXEL1022" />
            <bitfield mask="0x00000F00" name="PIXEL1021" />
            <bitfield mask="0x0000F000" name="PIXEL1020" />
            <bitfield mask="0x000F0000" name="PIXEL1019" />
            <bitfield mask="0x00F00000" name="PIXEL1018" />
            <bitfield mask="0x0F000000" name="PIXEL1017" />
            <bitfield mask="0xF0000000" name="PIXEL1016" />
         </register>
         <register caption="" name="GLCDCURDATA43" offset="0x8AC" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1031" />
            <bitfield mask="0x000000F0" name="PIXEL1030" />
            <bitfield mask="0x00000F00" name="PIXEL1029" />
            <bitfield mask="0x0000F000" name="PIXEL1028" />
            <bitfield mask="0x000F0000" name="PIXEL1027" />
            <bitfield mask="0x00F00000" name="PIXEL1026" />
            <bitfield mask="0x0F000000" name="PIXEL1025" />
            <bitfield mask="0xF0000000" name="PIXEL1024" />
         </register>
         <register caption="" name="GLCDCURDATA44" offset="0x8B0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL117" />
            <bitfield mask="0x000000F0" name="PIXEL116" />
            <bitfield mask="0x00000F00" name="PIXEL115" />
            <bitfield mask="0x0000F000" name="PIXEL114" />
            <bitfield mask="0x000F0000" name="PIXEL113" />
            <bitfield mask="0x00F00000" name="PIXEL112" />
            <bitfield mask="0x0F000000" name="PIXEL111" />
            <bitfield mask="0xF0000000" name="PIXEL110" />
         </register>
