Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/atdf/PIC32MZ1025DAB169.atdf
      <value-group caption="Interrupt with Priority Level 5 Shadow Set bits (1)" name="PRISS__PRI5SS">
         <value caption="Reserved (by default, an interrupt with a priority level of 5 uses Shadow Set 0)" name="" value="0xf" />
         <value caption="Reserved (by default, an interrupt with a priority level of 5 uses Shadow Set 0)" name="" value="0xe" />
         <value caption="Reserved (by default, an interrupt with a priority level of 5 uses Shadow Set 0)" name="" value="0xd" />
         <value caption="Reserved (by default, an interrupt with a priority level of 5 uses Shadow Set 0)" name="" value="0xc" />
         <value caption="Reserved (by default, an interrupt with a priority level of 5 uses Shadow Set 0)" name="" value="0xb" />
         <value caption="Reserved (by default, an interrupt with a priority level of 5 uses Shadow Set 0)" name="" value="0xa" />
         <value caption="Reserved (by default, an interrupt with a priority level of 5 uses Shadow Set 0)" name="" value="0x9" />
         <value caption="Reserved (by default, an interrupt with a priority level of 5 uses Shadow Set 0)" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 6 Shadow Set bits (1)" name="PRISS__PRI6SS">
         <value caption="Reserved (by default, an interrupt with a priority level of 6 uses Shadow Set 0)" name="" value="0xf" />
         <value caption="Reserved (by default, an interrupt with a priority level of 6 uses Shadow Set 0)" name="" value="0xe" />
         <value caption="Reserved (by default, an interrupt with a priority level of 6 uses Shadow Set 0)" name="" value="0xd" />
         <value caption="Reserved (by default, an interrupt with a priority level of 6 uses Shadow Set 0)" name="" value="0xc" />
         <value caption="Reserved (by default, an interrupt with a priority level of 6 uses Shadow Set 0)" name="" value="0xb" />
         <value caption="Reserved (by default, an interrupt with a priority level of 6 uses Shadow Set 0)" name="" value="0xa" />
         <value caption="Reserved (by default, an interrupt with a priority level of 6 uses Shadow Set 0)" name="" value="0x9" />
         <value caption="Reserved (by default, an interrupt with a priority level of 6 uses Shadow Set 0)" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 7 Shadow Set bits (1)" name="PRISS__PRI7SS">
         <value caption="Reserved (by default, an interrupt with a priority level of 7 uses Shadow Set 0)" name="" value="0xf" />
         <value caption="Reserved (by default, an interrupt with a priority level of 7 uses Shadow Set 0)" name="" value="0xe" />
         <value caption="Reserved (by default, an interrupt with a priority level of 7 uses Shadow Set 0)" name="" value="0xd" />
         <value caption="Reserved (by default, an interrupt with a priority level of 7 uses Shadow Set 0)" name="" value="0xc" />
         <value caption="Reserved (by default, an interrupt with a priority level of 7 uses Shadow Set 0)" name="" value="0xb" />
         <value caption="Reserved (by default, an interrupt with a priority level of 7 uses Shadow Set 0)" name="" value="0xa" />
         <value caption="Reserved (by default, an interrupt with a priority level of 7 uses Shadow Set 0)" name="" value="0x9" />
         <value caption="Reserved (by default, an interrupt with a priority level of 7 uses Shadow Set 0)" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 0" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02869" name="JTAG" version="2">
      <register-group name="JTAG">
         <register caption="" name="_ICDCON" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CKSWBKEN" />
            <bitfield mask="0x00000002" name="SLPBKEN" />
            <bitfield mask="0x00000004" name="WDTBKEN" />
            <bitfield mask="0x00000008" name="WDTEN" />
            <bitfield mask="0x00000010" name="RSTBUG" />
            <bitfield mask="0x00000020" name="DMTBKEN" />
            <bitfield mask="0x00000040" name="DMTEN" />
            <bitfield mask="0x00004000" name="FRZ" />
         </register>
         <register caption="" name="_ICDSTAT" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CKSWBF" />
            <bitfield mask="0x00000002" name="SLPBF" />
            <bitfield mask="0x00000004" name="WDTBF" />
            <bitfield mask="0x00000008" name="DMTBF" />
            <bitfield mask="0x00000010" name="WDTRUNBF" />
            <bitfield mask="0x00000020" name="WDTSLPBF" />
         </register>
      </register-group>
   </module>
   <module caption="" id="02819" name="NVM" version="2">
      <register-group name="NVM">
         <register caption="Flash Programming Control Register" name="NVMCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="NVM Operation bits" mask="0x0000000F" name="NVMOP" values="NVMCON__NVMOP" />
            <bitfield caption="Boot Flash Bank Alias Swap Control bit" mask="0x00000040" name="BFSWAP" values="NVMCON__BFSWAP" />
            <bitfield caption="Program Flash Bank Swap Control bit" mask="0x00000080" name="PFSWAP" values="NVMCON__PFSWAP" />
            <bitfield caption="Low-Voltage Detect Error bit" mask="0x00001000" name="LVDERR" values="NVMCON__LVDERR" />
            <bitfield caption="Write Error bit" mask="0x00002000" name="WRERR" values="NVMCON__WRERR" />
            <bitfield caption="Write Enable bit" mask="0x00004000" name="WREN" values="NVMCON__WREN" />
            <bitfield caption="Write Control bit" mask="0x00008000" name="WR" values="NVMCON__WR" />
         </register>
         <register caption="Programming Unlock Register" name="NVMKEY" offset="0x10" rw="W" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMKEY" />
         </register>
         <register caption="Flash Address Register" name="NVMADDR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMADDR" />
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA0" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA0" />
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA1" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA1" />
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA2" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA2" />
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA3" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA3" />
         </register>
